In [1]:
import numpy as np
import pandas as pd

In [2]:
#dataframes part 3 
#multi-index and hirarchey

In [4]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)
#we will never be using the above function, but just good to know

In [5]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [8]:
df = pd.DataFrame(np.random.randn(6,2),hier_index,['A','B'])
df

             A         B
G1 1  0.228989 -1.386032
   2  1.238370 -0.058562
   3 -1.050642  0.364060
G2 1  1.957238 -0.228070
   2 -0.701895 -0.638710
   3 -0.806229  0.519960

In [15]:
#calling data from a mltilevel hierarchy
df.loc['G1'].loc[1]

A    0.228989
B   -1.386032
Name: 1, dtype: float64

In [16]:
df.index.names

FrozenList([None, None])

In [18]:
df.index.names = ['Groups','Num']
df

                   A         B
Groups Num
G1     1    0.228989 -1.386032
       2    1.238370 -0.058562
       3   -1.050642  0.364060
G2     1    1.957238 -0.228070
       2   -0.701895 -0.638710
       3   -0.806229  0.519960

In [19]:
df.loc['G2'].loc[2]['B']

-0.63870975020929655

In [20]:
df.loc['G1'].loc[3]['A']

-1.0506421383555484

In [22]:
#now if we wanted to get the data from num index = 1 from both the groups
#for this purpose, using the loc operation will be tricky
#so, we use need to use the cross section 'xs' operator

In [26]:
df.xs(1,level='Num')

               A         B
Groups
G1      0.228989 -1.386032
G2      1.957238 -0.228070

**MISSING DATA**

In [28]:
#when we deal with big data, we encounter a lot of missing data
#to work with missing data, we have two methods dropna and fillna

In [30]:
d = {'A':[1,2,np.nan],'B':[1,np.nan,np.nan],'C':[1,2,3]}
d

{'A': [1, 2, nan], 'B': [1, nan, nan], 'C': [1, 2, 3]}

In [32]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [34]:
#we see that row 1 and column three are completely filled and the rest are half filled
#see the following operations with are self-explanatory

In [35]:
df.dropna()

     A    B  C
0  1.0  1.0  1

In [36]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [37]:
df.dropna(thresh=2)

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2

In [38]:
df.fillna(value="Filled this")

             A            B  C
0            1            1  1
1            2  Filled this  2
2  Filled this  Filled this  3

In [39]:
#what we usually do with fillna na is we fill the mean of values of the row using fillna
df['A'].fillna(value=df.A.mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [40]:
df['B'].fillna(value=df['B'].mean())

0    1.0
1    1.0
2    1.0
Name: B, dtype: float64

**USING GROUPBY**

In [42]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [43]:
#groupby in pandas funcions same as how groupby works in sql
#the following example is enough to help you

In [45]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [47]:
df.groupby('Company').mean()
#df.groupby() returns a groupby object
#using a aggregrate function on it gives us a dataframe

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [48]:
df.groupby('Company').sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [49]:

df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [51]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [52]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [53]:
df.groupby("Company").describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

**MERGING JOINING AND CONCATENATING**

In [54]:
#go through the lecture notes